----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 32, 32]           1,728
       BatchNorm2d-2           [-1, 64, 32, 32]             128
            Conv2d-3           [-1, 64, 32, 32]          36,864
       BatchNorm2d-4           [-1, 64, 32, 32]             128
            Conv2d-5           [-1, 64, 32, 32]          36,864
       BatchNorm2d-6           [-1, 64, 32, 32]             128
        BasicBlock-7           [-1, 64, 32, 32]               0
            Conv2d-8           [-1, 64, 32, 32]          36,864
       BatchNorm2d-9           [-1, 64, 32, 32]             128
           Conv2d-10           [-1, 64, 32, 32]          36,864
      BatchNorm2d-11           [-1, 64, 32, 32]             128
       BasicBlock-12           [-1, 64, 32, 32]               0
           Conv2d-13          [-1, 128, 16, 16]          73,728
      BatchNorm2d-14          [-1, 128, 16, 16]             256
           Conv2d-15          [-1, 128, 16, 16]         147,456
      BatchNorm2d-16          [-1, 128, 16, 16]             256
           Conv2d-17          [-1, 128, 16, 16]           8,192
      BatchNorm2d-18          [-1, 128, 16, 16]             256
       BasicBlock-19          [-1, 128, 16, 16]               0
           Conv2d-20          [-1, 128, 16, 16]         147,456
      BatchNorm2d-21          [-1, 128, 16, 16]             256
           Conv2d-22          [-1, 128, 16, 16]         147,456
      BatchNorm2d-23          [-1, 128, 16, 16]             256
       BasicBlock-24          [-1, 128, 16, 16]               0
           Conv2d-25            [-1, 256, 8, 8]         294,912
      BatchNorm2d-26            [-1, 256, 8, 8]             512
           Conv2d-27            [-1, 256, 8, 8]         589,824
      BatchNorm2d-28            [-1, 256, 8, 8]             512
           Conv2d-29            [-1, 256, 8, 8]          32,768
      BatchNorm2d-30            [-1, 256, 8, 8]             512
       BasicBlock-31            [-1, 256, 8, 8]               0
           Conv2d-32            [-1, 256, 8, 8]         589,824
      BatchNorm2d-33            [-1, 256, 8, 8]             512
           Conv2d-34            [-1, 256, 8, 8]         589,824
      BatchNorm2d-35            [-1, 256, 8, 8]             512
       BasicBlock-36            [-1, 256, 8, 8]               0
           Conv2d-37            [-1, 128, 4, 4]         294,912
      BatchNorm2d-38            [-1, 128, 4, 4]             256
           Conv2d-39            [-1, 128, 4, 4]         147,456
      BatchNorm2d-40            [-1, 128, 4, 4]             256
           Conv2d-41            [-1, 128, 4, 4]          32,768
      BatchNorm2d-42            [-1, 128, 4, 4]             256
       BasicBlock-43            [-1, 128, 4, 4]               0
           Conv2d-44            [-1, 128, 4, 4]         147,456
      BatchNorm2d-45            [-1, 128, 4, 4]             256
           Conv2d-46            [-1, 128, 4, 4]         147,456
      BatchNorm2d-47            [-1, 128, 4, 4]             256
       BasicBlock-48            [-1, 128, 4, 4]               0
           Conv2d-49             [-1, 64, 2, 2]          73,728
      BatchNorm2d-50             [-1, 64, 2, 2]             128
           Conv2d-51             [-1, 64, 2, 2]          36,864
      BatchNorm2d-52             [-1, 64, 2, 2]             128
           Conv2d-53             [-1, 64, 2, 2]           8,192
      BatchNorm2d-54             [-1, 64, 2, 2]             128
       BasicBlock-55             [-1, 64, 2, 2]               0
           Conv2d-56             [-1, 64, 2, 2]          36,864
      BatchNorm2d-57             [-1, 64, 2, 2]             128
           Conv2d-58             [-1, 64, 2, 2]          36,864
      BatchNorm2d-59             [-1, 64, 2, 2]             128
       BasicBlock-60             [-1, 64, 2, 2]               0
           Conv2d-61            [-1, 128, 1, 1]          73,728
      BatchNorm2d-62            [-1, 128, 1, 1]             256
           Conv2d-63            [-1, 128, 1, 1]         147,456
      BatchNorm2d-64            [-1, 128, 1, 1]             256
           Conv2d-65            [-1, 128, 1, 1]           8,192
      BatchNorm2d-66            [-1, 128, 1, 1]             256
       BasicBlock-67            [-1, 128, 1, 1]               0
           Conv2d-68            [-1, 256, 1, 1]         294,912
      BatchNorm2d-69            [-1, 256, 1, 1]             512
           Conv2d-70            [-1, 256, 1, 1]         589,824
      BatchNorm2d-71            [-1, 256, 1, 1]             512
           Conv2d-72            [-1, 256, 1, 1]          32,768
      BatchNorm2d-73            [-1, 256, 1, 1]             512
       BasicBlock-74            [-1, 256, 1, 1]               0
           Linear-75                   [-1, 10]           2,570
================================================================
Total params: 4,891,338
Trainable params: 4,891,338
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 10.73
Params size (MB): 18.66
Estimated Total Size (MB): 29.40
----------------------------------------------------------------